export const WeatherCodeMessage: Record<number, string> = {
  // Ясная погода
  0: 'Ясно',
  1: 'В основном ясно',
  2: 'Переменная облачность',
  3: 'Пасмурно',

  // Туман
  45: 'Туман',
  48: 'Туман (изморозь)',

  // Морось
  51: 'Лёгкая морось',
  53: 'Умеренная морось',
  55: 'Сильная морось',

  // Ледяная морось
  56: 'Лёгкая ледяная морось',
  57: 'Сильная ледяная морось',

  // Дождь
  61: 'Лёгкий дождь',
  63: 'Умеренный дождь',
  65: 'Сильный дождь',

  // Ледяной дождь
  66: 'Лёгкий ледяной дождь',
  67: 'Сильный ледяной дождь',

  // Снег
  71: 'Лёгкий снег',
  73: 'Умеренный снег',
  75: 'Сильный снег',
  77: 'Снежные зёрна',

  // Ливень
  80: 'Лёгкий ливень',
  81: 'Умеренный ливень',
  82: 'Сильный ливень',

  // Снегопад
  85: 'Лёгкий снегопад',
  86: 'Сильный снегопад',

  // Гроза
  95: 'Гроза',
  96: 'Гроза с лёгким градом',
  99: 'Гроза с сильным градом',

  // Ошибка
  900: 'Ошибка получения погоды',
};
